jbradfield2-718/LED_array_msp430/main_functions.c
/*
 * main_functions.c
 *
 * Created: 9/2/2013 3:03:49 PM
 *  Author: Turing
 */

//#include <msp430.h>
#include "msp430g2533.h"
#include "stdint.h"
#include <stdlib.h>
#include "main_functions.h"
#include "string.h"
#include "math.h"

#define MODE	(P1IN &= 1)							// Gets bit 0 to determine mode


volatile int one_sec_flag = 0;
volatile int swap_array_flag = 0;
volatile uint8_t start_life_flag = 0;
volatile uint8_t reset_game_flag = 0;
volatile uint8_t life_counter = 0;
volatile uint8_t life_reset = 0;
volatile uint16_t count = 0;
volatile uint8_t row = 0;

volatile uint8_t lowbyte = 0x00;
volatile uint8_t medlowbyte = 0x00;
volatile uint8_t medhighbyte = 0x00;
volatile uint8_t highbyte = 0x00;
volatile uint8_t colon_blink = 0;
volatile uint8_t am_pm = 1;							// Set to 0 for am, pm = 1
volatile uint8_t num = 0;							// This is a variable for testing array

/* 	Variables to hold the current time.  Clock only works with am/pm system 12 hr format.  To save updating entire array whenever time changes,
	I hold both the current and last (updated every second) state of the time.  When current digit does not match last state, update_clock function
	is called to update that portion of the array only. !! CURRENTLY NOT USED !!
*/
volatile uint8_t tens_hrs = 1;
//volatile uint8_t tens_hrs_last = 1;
volatile uint8_t ones_hrs = 1;
//volatile uint8_t ones_hrs_last = 2;
volatile uint8_t tens_mins = 4;
//volatile uint8_t tens_mins_last = 0;
volatile uint8_t ones_mins = 4;
//volatile uint8_t ones_mins_last = 0;

volatile uint32_t array[NUMROWS +1] =
{
		0x00000000, 0x00000000, 0x00000000, 0x00000000,
		0x00000000, 0x00000000, 0x00000000, 0x00000000,
		0x00000000, 0x00000000, 0x00000000, 0x00000000,
		0x00000000, 0x00000000, 0x00000000, 0x00000000

};

volatile uint32_t nextarray[NUMROWS +1] =
{
		0x00000000, 0x00000000, 0x00000000, 0x00000000,
		0x00000000, 0x00000000, 0x00000000, 0x00000000,
		0x00000000, 0x00000000, 0x00000000, 0x00000000,
		0x00000000, 0x00000000, 0x00000000, 0x00000000

};

// These are the numbers which will be displayed to the screen during clock mode.
// Hex values...each digit 12 pixels high, 5 pixels wide.  Store each row as a byte.
const uint8_t zero[12] =
{
		0x0e, 0x11, 0X11, 0X11, 0X11, 0X11, 0X11, 0X11, 0X11, 0X11, 0X11, 0X0e
};
const uint8_t one[12] =
{
		0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01
};
const uint8_t two[12] =
{
		0X1f, 0X10, 0X10, 0X10, 0X08, 0X04, 0X02, 0X01, 0X01, 0X11, 0x11, 0x0E
};
const uint8_t three[12] =
{
		0x0E, 0x11, 0X11, 0X01, 0X01, 0X01, 0X06, 0X01, 0X01, 0X11, 0X11, 0X0E
};
const uint8_t four[12] =
{
		0x01, 0x01, 0X01, 0X01, 0X01, 0X01, 0X1f, 0X11, 0X11, 0X11, 0X11, 0X01
};
const uint8_t five[12] =
{
		0x0e, 0x11, 0X11, 0X01, 0X01, 0X01, 0X01, 0X1e, 0X10, 0X10, 0X10, 0X1f
};
const uint8_t six[12] =
{
		0x0e, 0x11, 0X11, 0X11, 0X11, 0X1e, 0X10, 0X10, 0X10, 0X10, 0X10, 0X0e
};
const uint8_t seven[12] =
{
		0x04, 0x04, 0X04, 0X04, 0X02, 0X02, 0X02, 0X01, 0X01, 0X01, 0X01, 0X1f
};
const uint8_t eight[12] =
{
		0x0e, 0x11, 0X11, 0X11, 0X11, 0X11, 0X0e, 0X11, 0X11, 0X11, 0X11, 0X0e
};
const uint8_t nine[12] =
{
		0x0e, 0x11, 0X01, 0X01, 0X01, 0X01, 0X0f, 0X11, 0X11, 0X11, 0X11, 0X0e
};
const uint8_t colon[12] =
{
		0x00, 0x00, 0X00, 0X03, 0X03, 0X00, 0X00, 0X00, 0X03, 0X03, 0X00, 0X00
};
const uint8_t am[12] =
{
		0x15, 0x15, 0X15, 0X1b, 0X11, 0X00, 0X11, 0X11, 0X1f, 0X11, 0X0a, 0X04
};
const uint8_t pm[12] =
{
		0x15, 0x15, 0X15, 0X1b, 0X11, 0X00, 0X10, 0X10, 0X1c, 0X12, 0X12, 0X1c
};


void setup()
{
	// Setup DCO Freq...used as input to timers A
	WDTCTL = WDTPW + WDTHOLD;                 				// Stop WDT
	BCSCTL1 |= DIVA_3 + 15;									// SET RSELx to15, Divide ACLK by 3
	BCSCTL3 |= XCAP_2;
	DCOCTL |= BIT5 + BIT6 + BIT7;							// SET DCOx to 7...should set DCO ~16Mhz--26MHz...no oscilloscope. :(

	// Timer A0 setup count up compare interrupts @ high speed for write data to array from DCO
	TA0CCTL0 = CCIE;                             			// Timer A0 CCR0 interrupt enabled
	TA0CTL = TASSEL_2 + MC_1 + ID_0;           				// SMCLK no division, upmode
	TA0CCR0 =  5000;                            				// Assuming DCO is running at 16MHz, throws interrupt every 312uS, approx 3000Hz, 16 rows to display update at < 180Hz
	// Timer A1 setup
	TA1CCTL0 = CCIE;
	TA1CTL = TASSEL_1 + ID_3 + MC_1;						// TA1 on ACLK, Div by 8, upmode
	TA1CCR0 = 511;											// 32768/64 = 511 Throws interrupt @ 1Hz
	// Port edge interrupts for Port1
	P1IE |= BIT3 + BIT6 + BIT7;                            	 // P1.3, 1.6, 1.7 interrupt enabled
	P1IES |= BIT3 + BIT6 + BIT7;                    		// Hi/lo edge
	P1IFG &= ~BIT3 + BIT6 + BIT7;           					// P1 IFG cleared


	P1SEL = BIT2 + BIT4;
	P1SEL2 = BIT2 + BIT4;
	P2DIR = 0xFF;								              // Port B all output
	P2OUT &= 0x00;												// All pins port B 0

	// Setup SPI as master at SMCLK=DCO
	UCA0CTL0 |= UCCKPL + UCMST + UCSYNC;  					// 3-pin, 8-bit SPI master
	UCA0CTL1 |= UCSSEL_2;										// SMCLK as USI source
	//UCA0BR0 |= 0x02;                          // /2
	//UCA0BR1 = 0;                              //
	UCA0MCTL = 0;
	UCA0CTL1 &= ~UCSWRST;                     // **Initialize USCI state machine**

	_BIS_SR(GIE);                   			 // Enter LPM0 w/ interrupt
}


void rowselect(int curr_row)
{
	curr_row = curr_row << 1;					// Bitwise shift left, as Bit0 is used as latch (probably bad practice)...
	P2OUT = curr_row;
}

void update_array()
{
	uint8_t i;
		volatile unsigned long tmp1;

		lowbyte = 0xFF;
		medlowbyte = 0xFF;
		medhighbyte = 0xFF;
		highbyte = 0xFF;

		// This for loop extracts the lowbytes...note that i is an int, numcolumns = 31, numcolumns/2 = 15 (int truncates to 15)
		for(i=0; i<4; i++)
		{
			tmp1 =  array[row];		// Bitwise and shift by i columns to extract bit from array in tmp

			switch(i)
			{
			case(0):
					lowbyte = lowbyte &= tmp1;
					break;
			case(1):
					tmp1 = tmp1 >> 8;
					medlowbyte = medlowbyte &= tmp1;
					break;
			case(2):
					tmp1 = tmp1 >> 16;
					medhighbyte = medhighbyte &= tmp1;
					break;
			case(3):
					tmp1 = tmp1 >> 24;
					highbyte = highbyte &= tmp1;
					break;
			}
		}

		// Now we select row and display data...

