jbradfield2-718/LED_array_msp430/main_functions.c
		P2OUT |= BIT5;								// sets output enable high to stop display of line when changing data

		UCA0TXBUF = lowbyte;
		while (!(IFG2 & UCA0TXIFG));						// Sends data out to STDP05 LED Drivers...

		UCA0TXBUF = medlowbyte;
		while (!(IFG2 & UCA0TXIFG));

		UCA0TXBUF = medhighbyte;
		while (!(IFG2 & UCA0TXIFG));

		UCA0TXBUF = highbyte;
		while (!(IFG2 & UCA0TXIFG));


		 rowselect(row);
		 if(row < NUMROWS)
		 	{row++;}
		 else
		 	{row = 0;}

		 P2OUT |= BIT0;								// Pulses pin P2.0 TO latch in data to stp08dp05
		 P2OUT &= ~BIT0;

		 P2OUT &= ~BIT5;							// Resets Bit5 low to turn line back on
}


void swap_array()
{
	if(swap_array_flag)
	{
		//memcpy(&nextarray, &array_nminus2, sizeof(array_nminus2));		// Swaps nextarray with nminus2
		memcpy(&array, &nextarray, sizeof(array));						// Swaps nextarray with array

		swap_array_flag = 0;
	}

}


void seed_array()
{
	uint8_t i;
	for(i=0; i<=NUMROWS; i++)
	{nextarray[i] = 0x00000000;}					// Clears nextarray

	srand(TA0R);									// Seeds random numbers from Timer 0.
	volatile long int x, y;								// y variable represents current column, x-->row
	for (y = 0; y <= NUMCOLUMNS; y++)			// Creates the random initial state of the array with 1s and 0s.
		{
			for (x = 0; x <= NUMROWS; x++)
			{
				if(rand() % 2 == 0)
				{
					array[x] |= 1L << y;			// Sets bit in array
				}
				else
				{
					array[x] &= ~(1L << y);		// resets bit in array
				}
			}
		}

}

void reset_game()
{
	P2OUT |= BIT5;								// Sets bit5 to clear array
	uint8_t i;

	for(i=0; i<=NUMROWS; i++)
	{
		array[i] = 0x00000000;
		nextarray[i] = 0x00000000;
	}

	_delay_cycles(3000000);
	row = 0;

	//P2OUT &= ~BIT5								// Resets bit5 to turn array back on
	for(i=0; i<=NUMROWS; i++)
	{
		array[i] = 0xFFFFFFFF;
		update_array();
		_delay_cycles(500000);
	}
	_delay_cycles(500000);

	if(start_life_flag)
	{
		start_life_flag = 0;
		reset_game_flag = 0;
		return;
	}

	seed_array();
	reset_game_flag = 0;
}

uint8_t return_bit(unsigned long int bit)
{
	if (bit != 0)
		{return 1;}
	else
		return 0;
}

// Works with life subroutine to calculate the number of neighbors each cell has in the current array.  Note that this is modification of original code which used full array of uint8_t ints
// 32 x 16 = 512 byte for each array...too large to load program in RAM.  Reduced to array of uint32_t x 16 rows...now 64 byte each 8 fold reduction in memory space allocated but needs cumbersome
// bitwise operations to extract individual bits from the array of uint32_t
uint16_t calc_neighbors(uint8_t current_row, uint8_t current_column)
{
	volatile uint32_t tmp1, tmp2, tmp3, tmp4, tmp5, tmp6, tmp7, tmp8;
	uint8_t num_of_neighbors;
	// Calc boundry conditions first...the four vertices of the array
	// Lower Right
	if(current_row == 0 && current_column == 0)							/// Problem within subroutine is causing array to be overwritten....
	{
		tmp1 = array[current_row];
		tmp1 = tmp1 &= 1L << (current_column +1);
		tmp1 = return_bit(tmp1);

		tmp2 = array[current_row];
		tmp2 = tmp2 &= 1L << (NUMCOLUMNS);
		tmp2 = return_bit(tmp2);

		tmp3 = array[current_row+1];
		tmp3 = tmp3 &= 1L << (NUMCOLUMNS);
		tmp3 = return_bit(tmp3);

		tmp4 = array[current_row+1];
		tmp4 = tmp4 &= 1L << (current_column+1);
		tmp4 = return_bit(tmp4);

		tmp5 = array[current_row+1];
		tmp5 = tmp5 &= 1L << (current_column);
		tmp5 = return_bit(tmp5);

		tmp6 = array[NUMROWS];
		tmp6 = tmp6 &= 1L << (current_column);
		tmp6 = return_bit(tmp6);

		tmp7 = array[NUMROWS];
		tmp7 = tmp7 &= 1L << (current_column+1);
		tmp7 = return_bit(tmp7);

		tmp8 = array[NUMROWS];
		tmp8 = tmp8 &= 1L << (NUMCOLUMNS);
		tmp8 = return_bit(tmp8);


		num_of_neighbors = tmp1 + tmp2 + tmp3 + tmp4 + tmp5 + tmp6 + tmp7 + tmp8;
			return num_of_neighbors;
	}
	// Lower Left
	if(current_row == 0 && current_column == NUMCOLUMNS)
	{
		tmp1 = array[current_row];
		tmp1 = tmp1 &= 1L << (current_column -1);
		tmp1 = return_bit(tmp1);

		tmp2 = array[current_row+1];
		tmp2 = tmp2 &= 1L << (current_column);
		tmp2 = return_bit(tmp2);

		tmp3 = array[current_row+1];
		tmp3 = tmp3 &= 1L << (current_column-1);
		tmp3 = return_bit(tmp3);

		tmp4 = array[current_row];
		tmp4 = tmp4 &= 1L << (0);
		tmp4 = return_bit(tmp4);


		tmp5 = array[current_row+1];
		tmp5 = tmp5 &= 1L << (0);
		tmp5 = return_bit(tmp5);

		tmp6 = array[NUMROWS];
		tmp6 = tmp6 &= 1L << (current_column);
		tmp6 = return_bit(tmp6);


		tmp7 = array[NUMROWS];
		tmp7 = tmp7 &= 1L << (current_column-1);
		tmp7 = return_bit(tmp7);


		tmp8 = array[NUMROWS];
		tmp8 = tmp8 &= 1L << (0);
		tmp8 = return_bit(tmp8);


		num_of_neighbors = tmp1 + tmp2 + tmp3 + tmp4 + tmp5 + tmp6 + tmp7 + tmp8;
			return num_of_neighbors;
	}
	//upper right
	if(current_row == NUMROWS && current_column == 0)
	{
		tmp1 = array[current_row];
		tmp1 = tmp1 &= 1L << (current_column +1);
		tmp1 = return_bit(tmp1);

		tmp2 = array[current_row-1];
		tmp2 = tmp2 &= 1L << (current_column-1);
		tmp2 = return_bit(tmp2);

		tmp3 = array[current_row-1];
		tmp3 = tmp3 &= 1L << (current_column);
		tmp3 = return_bit(tmp3);

		tmp4 = array[current_row];
		tmp4 = tmp4 &= 1L << (NUMCOLUMNS);
		tmp4 = return_bit(tmp4);

		tmp5 = array[current_row-1];
		tmp5 = tmp5 &= 1L << (NUMCOLUMNS);
		tmp5 = return_bit(tmp5);

		tmp6 = array[0];
		tmp6 = tmp6 &= 1L << (current_column);
		tmp6 = return_bit(tmp6);

		tmp7 = array[0];
		tmp7 = tmp7 &= 1L << (current_column+1);
		tmp7 = return_bit(tmp7);

		tmp8 = array[0];
		tmp8 = tmp8 &= 1L << (NUMCOLUMNS);
		tmp8 = return_bit(tmp8);

		num_of_neighbors = tmp1 + tmp2 + tmp3 + tmp4 + tmp5 + tmp6 + tmp7 + tmp8;
			return num_of_neighbors;
	}
	//upper left
	if(current_row == NUMROWS && current_column == NUMCOLUMNS)
	{
		tmp1 = array[current_row];
		tmp1 = tmp1 &= 1L << (current_column -1);
		tmp1 = return_bit(tmp1);

		tmp2 = array[current_row-1];
		tmp2 = tmp2 &= 1L << (current_column-1);
		tmp2 = return_bit(tmp2);

		tmp3 = array[current_row-1];
		tmp3 = tmp3 &= 1L << (current_column);
		tmp3 = return_bit(tmp3);

