jbradfield2-718/LED_array_msp430/main_functions.c
		tmp4 = array[0];
		tmp4 = tmp4 &= 1L << (current_column);
		tmp4 = return_bit(tmp4);

		tmp5 = array[0];
		tmp5 = tmp5 &= 1L << (current_column-1);
		tmp5 = return_bit(tmp5);

		tmp6 = array[current_row];
		tmp6 = tmp6 &= 1L << (0);
		tmp6 = return_bit(tmp6);

		tmp7 = array[current_row-1];
		tmp7 = tmp7 &= 1L << (0);
		tmp7 = return_bit(tmp7);

		tmp8 = array[0];
		tmp8 = tmp8 &= 1L << (0);
		tmp8 = return_bit(tmp8);

		num_of_neighbors = tmp1 + tmp2 + tmp3 + tmp4 + tmp5 + tmp6 + tmp7 + tmp8;
			return num_of_neighbors;
	}

	// Now fall through to the edge cases which are not at vertices..
	//Bottom edge
	if(current_row == 0)
	{
		tmp1 = array[current_row];
		tmp1 = tmp1 &= 1L << (current_column +1);
		tmp1 = return_bit(tmp1);

		tmp2 = array[current_row+1];
		tmp2 = tmp2 &= 1L << (current_column+1);
		tmp2 = return_bit(tmp2);

		tmp3 = array[current_row+1];
		tmp3 = tmp3 &= 1L << (current_column);
		tmp3 = return_bit(tmp3);

		tmp4 = array[current_row+1];
		tmp4 = tmp4 &= 1L << (current_column-1);
		tmp4 = return_bit(tmp4);

		tmp5 = array[current_row];
		tmp5 = tmp5 &= 1L << (current_column-1);
		tmp5 = return_bit(tmp5);

		tmp6 = array[NUMROWS];
		tmp6 = tmp6 &= 1L << (current_column+1);
		tmp6 = return_bit(tmp6);

		tmp7 = array[NUMROWS];
		tmp7 = tmp7 &= 1L << (current_column);
		tmp7 = return_bit(tmp7);

		tmp8 = array[NUMROWS];
		tmp8 = tmp8 &= 1L << (current_column-1);
		tmp8 = return_bit(tmp8);

		num_of_neighbors = tmp1 + tmp2 + tmp3 + tmp4 + tmp5 + tmp6 + tmp7 + tmp8;
			return num_of_neighbors;
	}
	//Top edge
	if(current_row == NUMROWS)
	{
		tmp1 = array[current_row];
		tmp1 = tmp1 &= 1L << (current_column +1);
		tmp1 = return_bit(tmp1);

		tmp2 = array[current_row-1];
		tmp2 = tmp2 &= 1L << (current_column+1);
		tmp2 = return_bit(tmp2);

		tmp3 = array[current_row-1];
		tmp3 = tmp3 &= 1L << (current_column);
		tmp3 = return_bit(tmp3);

		tmp4 = array[current_row-1];
		tmp4 = tmp4 &= 1L << (current_column-1);
		tmp4 = return_bit(tmp4);

		tmp5 = array[current_row];
		tmp5 = tmp5 &= 1L << (current_column-1);
		tmp5 = return_bit(tmp5);

		tmp6 = array[0];
		tmp6 = tmp6 &= 1L << (current_column+1);
		tmp6 = return_bit(tmp6);

		tmp7 = array[0];
		tmp7 = tmp7 &= 1L << (current_column);
		tmp7 = return_bit(tmp7);

		tmp8 = array[0];
		tmp8 = tmp8 &= 1L << (current_column-1);
		tmp8 = return_bit(tmp8);

		num_of_neighbors = tmp1 + tmp2 + tmp3 + tmp4 + tmp5 + tmp6 + tmp7 + tmp8;
			return num_of_neighbors;
	}
	//Right edge
	if(current_column == 0)
	{
		tmp1 = array[current_row+1];
		tmp1 = tmp1 &= 1L << (current_column);
		tmp1 = return_bit(tmp1);

		tmp2 = array[current_row+1];
		tmp2 = tmp2 &= 1L << (current_column+1);
		tmp2 = return_bit(tmp2);

		tmp3 = array[current_row];
		tmp3 = tmp3 &= 1L << (current_column+1);
		tmp3 = return_bit(tmp3);

		tmp4 = array[current_row-1];
		tmp4 = tmp4 &= 1L << (current_column+1);
		tmp4 = return_bit(tmp4);

		tmp5 = array[current_row-1];
		tmp5 = tmp5 &= 1L << (current_column);
		tmp5 = return_bit(tmp5);

		tmp6 = array[current_row+1];
		tmp6 = tmp6 &= 1L << (NUMCOLUMNS);
		tmp6 = return_bit(tmp6);

		tmp7 = array[current_row];
		tmp7 = tmp7 &= 1L << (NUMCOLUMNS);
		tmp7 = return_bit(tmp7);

		tmp8 = array[current_row-1];
		tmp8 = tmp8 &= 1L << (NUMCOLUMNS);
		tmp8 = return_bit(tmp8);

		num_of_neighbors = tmp1 + tmp2 + tmp3 + tmp4 + tmp5 + tmp6 + tmp7 + tmp8;
			return num_of_neighbors;
	}
	//Left edge
	if(current_column == NUMCOLUMNS)
	{
		tmp1 = array[current_row+1];
		tmp1 = tmp1 &= 1L << (current_column);
		tmp1 = return_bit(tmp1);

		tmp2 = array[current_row+1];
		tmp2 = tmp2 &= 1L << (current_column-1);
		tmp2 = return_bit(tmp2);

		tmp3 = array[current_row];
		tmp3 = tmp3 &= 1L << (current_column-1);
		tmp3 = return_bit(tmp3);

		tmp4 = array[current_row-1];
		tmp4 = tmp4 &= 1L << (current_column-1);
		tmp4 = return_bit(tmp4);

		tmp5 = array[current_row-1];
		tmp5 = tmp5 &= 1L << (current_column);
		tmp5 = return_bit(tmp5);

		tmp6 = array[current_row+1];
		tmp6 = tmp6 &= 1L << (0);
		tmp6 = return_bit(tmp6);

		tmp7 = array[current_row];
		tmp7 = tmp7 &= 1L << (0);
		tmp7 = return_bit(tmp7);

		tmp8 = array[current_row-1];
		tmp8 = tmp8 &= 1L << (0);
		tmp8 = return_bit(tmp8);

		num_of_neighbors = tmp1 + tmp2 + tmp3 + tmp4 + tmp5 + tmp6 + tmp7 + tmp8;
				return num_of_neighbors;
	}

	// Fall through to base case in center of Board...
	tmp1 = array[current_row+1];
	tmp1 = tmp1 &= 1L << (current_column +1);
	tmp1 = return_bit(tmp1);

	tmp2 = array[current_row+1];
	tmp2 = tmp2 &= 1L << (current_column);
	tmp2 = return_bit(tmp2);

	tmp3 = array[current_row+1];
	tmp3 = tmp3 &= 1L << (current_column-1);
	tmp3 = return_bit(tmp3);

	tmp4 = array[current_row];
	tmp4 = tmp4 &= 1L << (current_column-1);
	tmp4 = return_bit(tmp4);

	tmp5 = array[current_row-1];
	tmp5 = tmp5 &= 1L << (current_column-1);
	tmp5 = return_bit(tmp5);

	tmp6 = array[current_row-1];
	tmp6 = tmp6 &= 1L << (current_column);
	tmp6 = return_bit(tmp6);

	tmp7 = array[current_row-1];
	tmp7 = tmp7 &= 1L << (current_column+1);
	tmp7 = return_bit(tmp7);

	tmp8 = array[current_row];
	tmp8 = tmp8 &= 1L << (current_column+1);
	tmp8 = return_bit(tmp8);

	num_of_neighbors = tmp1 + tmp2 + tmp3 + tmp4 + tmp5 + tmp6 + tmp7 + tmp8;
		return num_of_neighbors;
}
//==================================================================================================================
/*	Main routine to call various subroutines to display Conway's Game of Life from input seed.  Can work with
 * 	seed_array function or input from current time in array function then updates next_array with next value after
 * 	applying rules to current state of matrix. */
//==================================================================================================================
void life()
{
	// First checks to see if we are in clock only mode or if user has pused button to get random pattern.
	// If so, breaks from routine.
	if(MODE == 0)
	{
		if(start_life_flag != 1)
			{return;}
	}

	volatile unsigned long int test;
	uint16_t num_neighbors;
	volatile unsigned long int x, y;

	if (reset_game_flag == 1)
		{
			reset_game();
		}

