jbradfield2-718/LED_array_msp430/main_functions.c
	if (swap_array_flag)
		{
			return;						// If swap array set, do not recalculate array!
		}


	for (y = 0; y <= NUMCOLUMNS; y++)
		{
			for (x = 0; x <= NUMROWS; x++)
			{
				num_neighbors = calc_neighbors(x,y);


				test = array[x];
				// Current array live cell cases-----------------------------------
				if ( (test &= 1L << y) != 0)
				{
					if(num_neighbors < 2)
					{
						nextarray[x] &= ~(1L << y);				// Sets nextarray bit to dead state
					}
					if(num_neighbors == 2 || num_neighbors == 3)
					{
						nextarray[x] |= (1L << y);				// Sets nextarray bit to live state
					}
					if(num_neighbors > 3)
					{
						nextarray[x] &= ~(1L << y);				// Sets nextarray bit to dead state
					}
				}
				// Current array dead cell cases-----------------------------------
				else
				{
					if(num_neighbors == 3)
					{
						nextarray[x] |= (1L << y);				// Sets nextarray bit to live state
					}
				}
			}
		}

		// Restarts if the array is frozen or has still life with period 2
		if ( memcmp(&array, &nextarray, sizeof (array)) == 0 )		// Uses memcmp to determine if the arrays are stuck in identical state
		{														// to reset game
			reset_game_flag = 1;
		}


		swap_array_flag = 1; 									// Sets swap array flag to allow array to change at next 1sec interval


}

//======================================================================================================================================================
/*	Update clock function updates the array to hold the proper pattern for the current time.  Pass in digit to determine which portion of array
 * 	to be currently updated by function.  digit == 0, ones_mins.  digit == 1, tens_mins.  digit == 2, ones_hours.  digit == 3, tens_hours.
 */
//======================================================================================================================================================
void update_clock(uint8_t digit)
{
	uint8_t i, shift = 8, num = ones_mins;
	uint32_t tmp;

	if(digit == 3)
	{
		shift = 29;
		num = tens_hrs;
	}
	else if(digit == 2)
	{
		shift = 23;
		num = ones_hrs;
	}
	else if(digit == 1)
	{
		shift = 14;
		num = tens_mins;
	}

	/*	We want to now update entire array with the correct time...get individual time characters and load them to the array line by line in for loop */
	switch(num)
	{
		case(0):
			if(digit == 3)
			{
				for(i=2; i<14; i++)
				{
					tmp = 0x00000000;
					tmp = tmp << shift;
					array[i] |= tmp;				// So that we don't see the zero in front of the one prior to 10 o'clock
				}
				break;
			}
			for(i=2; i<14; i++)
			{
				tmp = zero[i-2];
				tmp = tmp << shift;
				array[i] |= tmp;				// Remember that numeric array is smaller than size of array...may cause bug...numeric array 8bits wide; we're ORing a section smaller than this
			}
			break;

		case(1):
			for(i=2; i<14; i++)
			{
				tmp = one[i-2];
				tmp = tmp << shift;
				array[i] |= tmp;				// Remember that numeric array is smaller than size of array...may cause bug...numeric array 8bits wide; we're ORing a section smaller than this
			}
			break;

		case(2):
			for(i=2; i<14; i++)
			{
				tmp = two[i-2];
				tmp = tmp << shift;
				array[i] |=  tmp;				// Remember that numeric array is smaller than size of array...may cause bug...numeric array 8bits wide; we're ORing a section smaller than this
			}
			break;

		case(3):
			for(i=2; i<14; i++)
			{
				tmp = three[i-2];
				tmp = tmp << shift;
				array[i] |=  tmp;				// Remember that numeric array is smaller than size of array...may cause bug...numeric array 8bits wide; we're ORing a section smaller than this
			}
			break;

		case(4):
			for(i=2; i<14; i++)
			{
				tmp = four[i-2];
				tmp = tmp << shift;
				array[i] |=  tmp;				// Remember that numeric array is smaller than size of array...may cause bug...numeric array 8bits wide; we're ORing a section smaller than this
			}
			break;

		case(5):
			for(i=2; i<14; i++)
			{
				tmp = five[i-2];
				tmp = tmp << shift;
				array[i] |=  tmp;				// Remember that numeric array is smaller than size of array...may cause bug...numeric array 8bits wide; we're ORing a section smaller than this
			}
			break;

		case(6):
			for(i=2; i<14; i++)
			{
				tmp = six[i-2];
				tmp = tmp << shift;
				array[i] |=  tmp;				// Remember that numeric array is smaller than size of array...may cause bug...numeric array 8bits wide; we're ORing a section smaller than this
			}
			break;

		case(7):
			for(i=2; i<14; i++)
			{
				tmp = seven[i-2];
				tmp = tmp << shift;
				array[i] |=  tmp;				// Remember that numeric array is smaller than size of array...may cause bug...numeric array 8bits wide; we're ORing a section smaller than this
			}
			break;

		case(8):
			for(i=2; i<14; i++)
			{
				tmp = eight[i-2];
				tmp = tmp << shift;
				array[i] |=  tmp;				// Remember that numeric array is smaller than size of array...may cause bug...numeric array 8bits wide; we're ORing a section smaller than this
			}
			break;

		case(9):
			for(i=2; i<14; i++)
			{
				tmp = nine[i-2];
				tmp = tmp << shift;
				array[i] |=  tmp;				// Remember that numeric array is smaller than size of array...may cause bug...numeric array 8bits wide; we're ORing a section smaller than this
			}
			break;
	}


}

//==================================================================================================================
/*	Subroutine which updates the variables which hold the current time value.  Called from Timer1 ISR when count
 * 	reaches 60sec to increment minutes/hrs. */
//==================================================================================================================
void update_time()
{
// Catches case of 59 min rollover to next hour.
	if(ones_mins == 9 && tens_mins == 5)
	{
		ones_mins = 0;
		tens_mins = 0;

		// Case of 12th hr rollover to 1
		if (tens_hrs == 1 && ones_hrs == 2 )
		{
			tens_hrs = 0;
			ones_hrs = 1;
			return;
		}
		if (tens_hrs == 1 && ones_hrs == 1)
		{
			am_pm ^= 1;
			ones_hrs++;
			return;
		}								// Toggles from am to pm
		if (ones_hrs == 9)
		{
			tens_hrs = 1;
			ones_hrs = 0;
			return;
		}

		ones_hrs++;
	}

	else if(ones_mins == 9)
	{
		ones_mins = 0;
		tens_mins++;
	}

	else				// Falls through to just increment minutes by 1
	{
		ones_mins++;
		return;
	}
}

// Need to continually call this code in certain instances when setting time...implement as function
void clk_update_macro()
{
	uint8_t i;
	uint32_t tmp;
	for(i=0; i<16; i++)
				{
					array[i] = 0x00000000;		// First, clears array before we update pattern for new time.  We can improve update speed if we only update what we need, but this may be fast enough
				}

			for(i=0; i<4; i++)
			{
				update_clock(i);
			}

