jbradfield2-718/LED_array_msp430/main_functions.c
	// adds colon
			for(i=2; i<14; i++)
					{
						tmp = colon[i-2];
						tmp = tmp << 20;
						array[i] |=  tmp;			// colonblink outside update_clock so we're not wasting cyles to constantly update this.
					}
	// Loads array for AM/PM
			if(am_pm == 1)
			{
				for(i=2; i<14; i++)
				{
					tmp = pm[i-2];
					tmp = tmp << 2;
					array[i] |=  tmp;
				}
			}
			if(am_pm == 0)
			{
				for(i=2; i<14; i++)
				{
					tmp = am[i-2];
					tmp = tmp << 2;
					array[i] |=  tmp;
				}
			}
}

//==================================================================================================================
/*	Allows user to manually set time.  Called from ISR on Port 1.6 */
//==================================================================================================================
void set_clk_hrs()
{
	uint8_t i;
	if(tens_hrs == 1 && ones_hrs == 1)
	{
		ones_hrs++;
		am_pm ^= 1;
		clk_update_macro();
		return;
	}

	if(tens_hrs == 1 && ones_hrs == 2)
	{
		tens_hrs = 0;
		ones_hrs = 1;
		clk_update_macro();
		return;
	}

	if(ones_hrs == 9 && tens_hrs == 0)
	{
		tens_hrs = 1;
		ones_hrs = 0;
		clk_update_macro();
		return;
	}

	ones_hrs++;
	clk_update_macro();
	return;
}

//==================================================================================================================
/*	Allows user to manually set time.  Called from ISR on Port 1.7 */
//==================================================================================================================
void set_clk_mins()
{
	uint8_t i;
	if(tens_mins == 5 && ones_mins == 9)
	{
		ones_mins = 0;
		tens_mins = 0;
		clk_update_macro();
		return;
	}

	if(ones_mins == 9)
	{
		tens_mins++;
		ones_mins = 0;
		clk_update_macro();
		return;
	}

	ones_mins++;
	clk_update_macro();
	return;
}

// Timer A0 interrupt service routine
#pragma vector=TIMER0_A0_VECTOR
__interrupt void Timer_A0 (void)
{
	one_sec_flag++;
		if(one_sec_flag >= 500)
		{
			one_sec_flag = 0;
			swap_array();
		}

		update_array();


}


// Timer A0 interrupt service routine.  This implements the clock function of the LED array.
#pragma vector=TIMER1_A0_VECTOR
__interrupt void Timer_A1 (void)
{
	if(MODE == 1)
	{
		life_reset++;						// Allows reset of life pattern after 60 ticks

		if(life_reset >= 60)
		{
			life_reset = 0;
			reset_game();
		}
	}

	count++;							// Count corresponds to clock function
//	update_time();
	if(count >= 60)
		{
			count = 0;
			update_time();
		}

	if(life_counter == 60)
		{
			life_counter = 0;
			reset_game();
			start_life_flag = 0;
		}

	if(start_life_flag)
	{
		life_counter++;
		goto end_Timer1_ISR;
	}

	if(MODE == 1)
	{goto end_Timer1_ISR;}

/* Clock Time only portion of ISR */
	colon_blink ^= 1;							// Toggles so we get colon to blink at 2 Hz
//	update_time();

	uint8_t i;
	uint32_t tmp;
	for(i=0; i<16; i++)
		{
			array[i] = 0x00000000;		// First, clears array before we update pattern for new time.  We can improve update speed if we only update what we need, but this may be fast enough
		}

	for(i=0; i<4; i++)
	{
		update_clock(i);				// Updates all 4 digits of array.
	}

	if(colon_blink == 1)
	{
		for(i=2; i<14; i++)
		{
			tmp = colon[i-2];
			tmp = tmp << 20;
			array[i] |=  tmp;			// colonblink outside update_clock so we're not wasting cyles to constantly update this.
		}
	}

	if(am_pm == 1)
	{
		for(i=2; i<14; i++)
		{
			tmp = pm[i-2];
			tmp = tmp << 2;
			array[i] |=  tmp;
		}
	}
	if(am_pm == 0)
	{
		for(i=2; i<14; i++)
		{
			tmp = am[i-2];
			tmp = tmp << 2;
			array[i] |=  tmp;
		}
	}

	end_Timer1_ISR:						// Branch for goto loops for end ISR
}

#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void)
{
	uint8_t tmp = P1IFG;

	if(tmp &= BIT6)
	{
		if(MODE == 0 && start_life_flag != 1)
		{
			set_clk_hrs();
		}
		P1IFG &= ~BIT6;
		goto end_Port1_ISR;
	}

	tmp = P1IFG;
	if(tmp &= BIT7)
	{
		if(MODE == 0 && start_life_flag != 1)
		{
			set_clk_mins();
		}
		P1IFG &= ~BIT7;
		goto end_Port1_ISR;
	}

   start_life_flag = 1;
   P1IFG &= ~BIT3; 		                   // P1.3 IFG cleared

   end_Port1_ISR:
}
